src/Documents/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукции</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>InformationRegister.Себестоимость</registerRecords>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Себестоимость</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректироватьЦенуВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГотоваяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ВыпускПродукции/Forms/ФормаДокумента/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьСебестоимость(Номенклатура)
	
	Возврат ОбщегоНазначения.ПолучитьСебестоимостьТовара(Номенклатура);
	
КонецФункции

&НаКлиенте
Процедура КомплектующиеКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Комплектующие.ТекущиеДанные;                          
	Себестоимость = ПолучитьСебестоимость(ТекущиеДанные.Номенклатура);
	Если Себестоимость <> Неопределено Тогда
		ТекущиеДанные.Себестоимость = ПолучитьСебестоимость(ТекущиеДанные.Номенклатура) * ТекущиеДанные.Количество;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Себестоимость товара ""%1"" не установлена", ТекущиеДанные.Номенклатура);
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция РасчитатьЦенуНаСервере(Себестоимость)
	
	Возврат ОбщегоНазначения.РасчитатьЦену(Себестоимость);
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Себестоимость = Объект.Комплектующие.Итог("Себестоимость") / Объект.Количество;
	Если Не Объект.КорректироватьЦенуВручную И Объект.ГотоваяПродукция Тогда
		Объект.Цена = РасчитатьЦенуНаСервере(Объект.Себестоимость);
		Прибыль = Объект.Цена - Объект.Себестоимость;
	Иначе
		Объект.Цена = 0;
		Прибыль = 0;
	КонецЕсли;
	
КонецПроцедуры
